Repository: baasith1124/CarRentalSys
Catalog: CarRentalSystem.Web/Resources/ValidationMessages.*.resx
Languages: si_lk, ta_lk

# Required
source: {PropertyName} is required.
si_lk: {PropertyName} අවශ්‍යයි.
ta_lk: {PropertyName} தேவை.

# EmailInvalid
source: Invalid email address format.
si_lk: වලංගු නොවන ඊමේල් ලිපින ආකෘතිය.
ta_lk: தவறான மின்னஞ்சல் முகவரி வடிவம்.

# EmailRequired
source: Email is required.
si_lk: ඊමේල් අවශ්‍යයි.
ta_lk: மின்னஞ்சல் தேவை.

# EmailMaxLength
source: Email cannot exceed {MaxLength} characters.
si_lk: ඊමේල් {MaxLength} අකුරු ඉක්මවිය නොහැක.
ta_lk: மின்னஞ்சல் {MaxLength} எழுத்துகளை மீற முடியாது.

# NameRequired
source: Full name is required.
si_lk: සම්පූර්ණ නම අවශ්‍යයි.
ta_lk: முழு பெயர் தேவை.

# NameMaxLength
source: Full name cannot exceed {MaxLength} characters.
si_lk: සම්පූර්ණ නම {MaxLength} අකුරු ඉක්මවිය නොහැක.
ta_lk: முழு பெயர் {MaxLength} எழுத்துகளை மீற முடியாது.

# NameFormat
source: Full name can only contain letters and spaces.
si_lk: සම්පූර්ණ නම අකුරු සහ හිස් තැන් පමණක් අඩංගු විය හැක.
ta_lk: முழு பெயர் எழுத்துகள் மற்றும் இடைவெளிகளை மட்டுமே கொண்டிருக்க முடியும்.

# NICMaxLength
source: NIC cannot exceed {MaxLength} characters.
si_lk: ජාතික හැඳුනුම්පත් අංකය {MaxLength} අකුරු ඉක්මවිය නොහැක.
ta_lk: தேசிய அடையாள எண் {MaxLength} எழுத்துகளை மீற முடியாது.

# NICFormat
source: Invalid NIC format.
si_lk: වලංගු නොවන ජාතික හැඳුනුම්පත් අංක ආකෘතිය.
ta_lk: தவறான தேசிய அடையாள எண் வடிவம்.

# AddressMaxLength
source: Address cannot exceed {MaxLength} characters.
si_lk: ලිපිනය {MaxLength} අකුරු ඉක්මවිය නොහැක.
ta_lk: முகவரி {MaxLength} எழுத்துகளை மீற முடியாது.

# CarNameRequired
source: Car name is required.
si_lk: මෝටර් රථ නම අවශ්‍යයි.
ta_lk: கார் பெயர் தேவை.

# CarNameMaxLength
source: Car name cannot exceed {MaxLength} characters.
si_lk: මෝටර් රථ නම {MaxLength} අකුරු ඉක්මවිය නොහැක.
ta_lk: கார் பெயர் {MaxLength} எழுத்துகளை மீற முடியாது.

# CarModelRequired
source: Car model is required.
si_lk: මෝටර් රථ ආකෘතිය අවශ්‍යයි.
ta_lk: கார் மாதிரி தேவை.

# CarModelMaxLength
source: Car model cannot exceed {MaxLength} characters.
si_lk: මෝටර් රථ ආකෘතිය {MaxLength} අකුරු ඉක්මවිය නොහැක.
ta_lk: கார் மாதிரி {MaxLength} எழுத்துகளை மீற முடியாது.

# YearMin
source: Year must be greater than {MinYear}.
si_lk: වර්ෂය {MinYear} ට වඩා වැඩි විය යුතුය.
ta_lk: ஆண்டு {MinYear} ஐ விட அதிகமாக இருக்க வேண்டும்.

# YearMax
source: Year cannot be more than one year in the future.
si_lk: වර්ෂය අනාගත වර්ෂයකට වඩා වැඩි විය නොහැක.
ta_lk: ஆண்டு எதிர்கால ஆண்டை விட அதிகமாக இருக்க முடியாது.

# RatePerDayMin
source: Rate per day must be greater than 0.
si_lk: දිනකට ගණන් 0 ට වඩා වැඩි විය යුතුය.
ta_lk: நாள் விகிதம் 0 ஐ விட அதிகமாக இருக்க வேண்டும்.

# AvailableFromRequired
source: Available from date is required.
si_lk: ලබා ගත හැකි දිනය අවශ්‍යයි.
ta_lk: கிடைக்கும் தேதி தேவை.

# AvailableToRequired
source: Available to date is required.
si_lk: ලබා ගත හැකි දිනය අවශ්‍යයි.
ta_lk: கிடைக்கும் தேதி தேவை.

# DateFromBeforeTo
source: Available from date must be before available to date.
si_lk: ලබා ගත හැකි දිනය අවසන් දිනයට පෙර විය යුතුය.
ta_lk: கிடைக்கும் தேதி முடிவு தேதிக்கு முன் இருக்க வேண்டும்.

# DateToAfterFrom
source: Available to date must be after available from date.
si_lk: ලබා ගත හැකි අවසන් දිනය ආරම්භක දිනයට පසු විය යුතුය.
ta_lk: கிடைக்கும் முடிவு தேதி தொடக்க தேதிக்கு பிறகு இருக்க வேண்டும்.

# OwnerIdRequired
source: Owner ID is required.
si_lk: හිමිකරු හැඳුනුම්පත අවශ්‍යයි.
ta_lk: உரிமையாளர் அடையாளம் தேவை.

# DescriptionMaxLength
source: Description cannot exceed {MaxLength} characters.
si_lk: විස්තරය {MaxLength} අකුරු ඉක්මවිය නොහැක.
ta_lk: விளக்கம் {MaxLength} எழுத்துகளை மீற முடியாது.

# FeaturesMaxLength
source: Features cannot exceed {MaxLength} characters.
si_lk: විශේෂාංග {MaxLength} අකුරු ඉක්මවිය නොහැක.
ta_lk: அம்சங்கள் {MaxLength} எழுத்துகளை மீற முடியாது.

# CarIdRequired
source: Car ID is required.
si_lk: මෝටර් රථ හැඳුනුම්පත අවශ්‍යයි.
ta_lk: கார் அடையாளம் தேவை.

# CustomerIdRequired
source: Customer ID is required.
si_lk: පාරිභෝගික හැඳුනුම්පත අවශ්‍යයි.
ta_lk: வாடிக்கையாளர் அடையாளம் தேவை.

# PickupDateRequired
source: Pickup date is required.
si_lk: අරගෙන යන දිනය අවශ්‍යයි.
ta_lk: எடுக்கும் தேதி தேவை.

# PickupDatePast
source: Pickup date cannot be in the past.
si_lk: අරගෙන යන දිනය අතීතයේ විය නොහැක.
ta_lk: எடுக்கும் தேதி கடந்த காலத்தில் இருக்க முடியாது.

# PickupDateBeforeReturn
source: Pickup date must be before return date.
si_lk: අරගෙන යන දිනය ආපසු ලබා දෙන දිනයට පෙර විය යුතුය.
ta_lk: எடுக்கும் தேதி திரும்பும் தேதிக்கு முன் இருக்க வேண்டும்.

# ReturnDateRequired
source: Return date is required.
si_lk: ආපසු ලබා දෙන දිනය අවශ්‍යයි.
ta_lk: திரும்பும் தேதி தேவை.

# ReturnDateAfterPickup
source: Return date must be after pickup date.
si_lk: ආපසු ලබා දෙන දිනය අරගෙන යන දිනයට පසු විය යුතුය.
ta_lk: திரும்பும் தேதி எடுக்கும் தேதிக்கு பிறகு இருக்க வேண்டும்.

# BookingMinDuration
source: Booking must be at least 30 minutes long.
si_lk: කොට්ඨාශය අවම වශයෙන් මිනිත්තු 30 ක් විය යුතුය.
ta_lk: முன்பதிவு குறைந்தது 30 நிமிடங்கள் இருக்க வேண்டும்.

# TotalCostMin
source: Total cost must be greater than 0.
si_lk: මුළු පිරිවැය 0 ට වඩා වැඩි විය යුතුය.
ta_lk: மொத்த செலவு 0 ஐ விட அதிகமாக இருக்க வேண்டும்.

# CarApprovalStatusIdRequired
source: Car approval status ID is required.
si_lk: මෝටර් රථ අනුමත තත්ව හැඳුනුම්පත අවශ්‍යයි.
ta_lk: கார் ஒப்புதல் நிலை அடையாளம் தேவை.

# ProfileImagePathMaxLength
source: Profile image path cannot exceed {MaxLength} characters.
si_lk: පැතිකඩ රූපයේ මාර්ගය {MaxLength} අකුරු ඉක්මවිය නොහැක.
ta_lk: சுயவிவர படத்தின் பாதை {MaxLength} எழுத்துகளை மீற முடியாது.

# CarNotAvailable
source: This car is already booked for the selected period.
si_lk: මෙම මෝටර් රථය දැනටමත් තෝරාගත් කාලය සඳහා වෙන් කර ඇත.
ta_lk: இந்த கார் ஏற்கனவே தேர்ந்தெடுக்கப்பட்ட காலத்திற்கு முன்பதிவு செய்யப்பட்டுள்ளது.
